test-results/output-hotspot-11-cds/ab_output.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /greetings
Document Length:        26 bytes

Concurrency Level:      5
Time taken for tests:   1.523 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      725000 bytes
HTML transferred:       130000 bytes
Requests per second:    3282.18 [#/sec] (mean)
Time per request:       1.523 [ms] (mean)
Time per request:       0.305 [ms] (mean, across all concurrent requests)
Transfer rate:          464.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   0.9      1      16
Waiting:        0    1   0.8      1      16
Total:          1    1   0.9      1      16

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      3
  98%      4
  99%      4
 100%     16 (longest request)